Repository: ryzamd/Warehouse-Scan
Catalog: lib/l10n/intl_*.arb
Languages: vi, zh_cn, zh_tw

# loginButton
source: Login
vi: Đăng nhập
zh_cn: 登录
zh_tw: 登入

# usernameHint
source: Please select username
vi: Chọn tên đăng nhập
zh_cn: 请选择用户名
zh_tw: 請選擇用戶名

# passwordHint
source: Enter password
vi: Nhập mật khẩu
zh_cn: 输入密码
zh_tw: 輸入密碼

# pleaseEnterUsername
source: Please enter your username
vi: Nhập tên đăng nhập
zh_cn: 请输入用户名
zh_tw: 請輸入用戶名

# pleaseEnterPassword
source: Please enter your password
vi: Nhập mật khẩu
zh_cn: 请输入密码
zh_tw: 請輸入密碼

# loginFailedUPCASE
source: LOGIN FAILED
vi: ĐĂNG NHẬP THẤT BẠI
zh_cn: 登录失败
zh_tw: 登入失敗

# errorUPCASE
source: ERROR
vi: LỖI
zh_cn: 错误
zh_tw: 錯誤

# successUPCASE
source: SUCCESS
vi: THÀNH CÔNG
zh_cn: 成功
zh_tw: 成功

# profileUPCASE
source: PROFILE
vi: HỒ SƠ
zh_cn: 个人资料
zh_tw: 個人資料

# warehouseManagerLabel
source: Warehouse Manager
vi: Quản lý kho
zh_cn: 仓库管理
zh_tw: 倉庫管理

# warehouseInLabel
source: Import
vi: Nhập kho
zh_cn: 入库
zh_tw: 入庫

# warehouseOutLabel
source: Export
vi: Xuất kho
zh_cn: 出库
zh_tw: 出庫

# inventoryCheckLabel
source: Inventory
vi: Kiểm kê
zh_cn: 盘点
zh_tw: 盤點

# batchScanLabel
source: Batch Scan
vi: Quét hàng loạt
zh_cn: 批量扫描
zh_tw: 批量掃描

# okButtonUPCASE
source: OK
zh_cn: 确定
zh_tw: 確定

# cancelButton
source: Cancel
vi: Hủy
zh_cn: 取消
zh_tw: 取消

# confirmButtonDialog
source: Confirm
vi: Xác nhận
zh_cn: 确认
zh_tw: 確認

# logoutButtonUPCASE
source: LOGOUT
vi: ĐĂNG XUẤT
zh_cn: 登出
zh_tw: 登出

# logoutConfirmMessage
source: Are you sure you want to log out?
vi: Bạn muốn đăng xuất?
zh_cn: 您确定要退出登录吗？
zh_tw: 您確定要登出嗎？

# networkErrorMessage
source: No internet connection. Please check your network settings and try again.
vi: Không có mạng. Kiểm tra kết nối và thử lại.
zh_cn: 网络连接错误，请检查网络设置并重试。
zh_tw: 網絡連接錯誤，請檢查網絡設置並重試。

# serverErrorMessage
source: Cannot connect to server.
vi: Không kết nối được máy chủ.
zh_cn: 无法连接到服务器。
zh_tw: 無法連接到伺服器。

# warehouseMenuTitle
source: Warehouse Menu
vi: Menu kho
zh_cn: 仓库管理
zh_tw: 倉庫管理

# importMaterialMenuTitle
source: Import Material
vi: Nhập vật liệu
zh_cn: 入库管理
zh_tw: 入庫作業

# exportMaterialMenuTitle
source: Export Material
vi: Xuất vật liệu
zh_cn: 出库管理
zh_tw: 出庫作業

# batchScanMenuTitle
source: Batch Scan
vi: Quét hàng loạt
zh_cn: 批量扫描
zh_tw: 批量掃描

# inventoryMenuTitle
source: Inventory
vi: Kiểm kê
zh_cn: 库存盘点
zh_tw: 庫存盤點

# cannotAccessCamera
source: Cannot access camera: {error}
vi: Không truy cập camera: {error}
zh_cn: 无法访问相机: {error}
zh_tw: 無法存取相機: {error}

# clearDataTitleUPCASE
source: CLEAR DATA
vi: XÓA DỮ LIỆU
zh_cn: 清除数据
zh_tw: 清除數據

# clearDataMessage
source: Are you sure you want to clear all items from the batch?
vi: Xóa tất cả các mục?
zh_cn: 确定要清除所有数据吗？
zh_tw: 您確定要清除所有數據嗎？

# clearButton
source: Clear
vi: Xóa
zh_cn: 清除
zh_tw: 清除

# batchScanTitleUPCASE
source: BATCH SCAN
vi: QUÉT HÀNG LOẠT
zh_cn: 批量扫描
zh_tw: 批量掃描

# batchItems
source: Batch Items ({count})
vi: Mục ({count})
zh_cn: 批量项目 ({count})
zh_tw: 批量項目 ({count})

# executeButton
source: Execute
vi: Thực hiện
zh_cn: 执行
zh_tw: 執行

# successfullyProcessed
source: Successfully processed {successCount} items.
vi: Đã xử lý {successCount} mục.
zh_cn: 处理成功 {successCount} 物品
zh_tw: 成功處理 {successCount} 件商品

# failedToProcess
source: Failed to process {failCount} items.
vi: Lỗi {failCount} mục.
zh_cn: 处理失败 {failCount} 物品
zh_tw: 處理失敗 {failCount} 件商品

# batchItemAlreadyExistsMessage
source: This item is already in the list.
vi: Mục đã tồn tại.
zh_cn: 批次项目已存在
zh_tw: 此項目已存在於批次中

# errorCheckingItemMessage
source: Error checking item: {error}
vi: Lỗi: {error}
zh_cn: 检查项目时出错: {error}
zh_tw: 檢查項目時發生錯誤: {error}

# batchIsEmptyMessage
source: Batch is empty. Please scan items first.
vi: Danh sách trống. Quét mục trước.
zh_cn: 批次为空
zh_tw: 批次清單為空

# errorProcessingBatchMessage
source: Error processing batch: {error}
vi: Lỗi xử lý: {error}
zh_cn: 处理批次时出错: {error}
zh_tw: 處理批次時發生錯誤: {error}

# batchListNoItemsMessage
source: No items in batch. Scan QR codes to add.
vi: Không có mục. Quét mã QR.
zh_cn: 没有批量项目
zh_tw: 沒有批量項目

# batchListCodeWithValue
source: Code: {code}
vi: Mã: {code}
zh_cn: 条码: {code}
zh_tw: 條碼：{code}

# batchListNameWithValue
source: Name: {name}
vi: Tên: {name}
zh_cn: 名称: {name}
zh_tw: 名稱：{name}

# batchListQuantityWithValue
source: Quantity: {quantity} {unit}
vi: SL: {quantity} {unit}
zh_cn: 数量: {quantity} {unit}
zh_tw: 數量：{quantity} {unit}

# batchListErrorWithValue
source: Error: {error}
vi: Lỗi: {error}
zh_cn: 错误: {error}
zh_tw: 錯誤：{error}

# qrInitializingCameraMessage
source: Initializing camera...
vi: Đang khởi tạo camera...
zh_cn: 正在初始化摄像头...
zh_tw: 正在初始化攝影機...

# qrCameraErrorMessage
source: Camera error: {errorCode}
vi: Lỗi: {errorCode}
zh_cn: 摄像头错误：{errorCode}
zh_tw: 攝影機錯誤：{errorCode}

# qrTryAgainButton
source: Try Again
vi: Thử lại
zh_cn: 重试
zh_tw: 重試

# qrCameraIsOffStatus
source: Camera is off
vi: Camera tắt
zh_cn: 摄像头已关闭
zh_tw: 攝影機已關閉

# importSuccessTitle
source: IMPORT SUCCESS
vi: NHẬP THÀNH CÔNG
zh_cn: 导入成功
zh_tw: 導入成功

# importSuccessMessage
source: The material has been successfully imported to the warehouse.
vi: Đã nhập vào kho thành công.
zh_cn: 数据已成功导入
zh_tw: 數據已成功導入

# importPageTitle
source: IMPORT PAGE
vi: NHẬP KHO
zh_cn: 导入数据
zh_tw: 導入頁面

# scanInstructionMessage
source: Scan QR code to process warehouse-in materials
vi: Quét mã QR
zh_cn: 请将二维码对准扫描框
zh_tw: 請掃描條碼

# flashIconButton
source: Flash
vi: Đèn
zh_cn: 闪光灯
zh_tw: 閃光燈

# flipIconButton
source: Flip
vi: Xoay
zh_cn: 切换摄像头
zh_tw: 翻轉相機

# stopIconButton
source: Stop
vi: Dừng
zh_cn: 停止
zh_tw: 停止

# starIconButton
source: Start
vi: Bắt đầu
zh_cn: 开始
zh_tw: 收藏

# cameraInitializationErrorMessage
source: Camera initialization error: {error}
vi: Lỗi camera: {error}
zh_cn: 相机初始化失败: {error}
zh_tw: 初始化相機時發生錯誤: {error}

# dataHasAlreadyBeenStoredMessage
source: Data has already been stored.
vi: Dữ liệu đã lưu.
zh_cn: 数据已存储
zh_tw: 資料已儲存

# exportPageTitle
source: EXPORT PAGE
vi: XUẤT KHO
zh_cn: 导出数据
zh_tw: 出庫頁面

# clearDataUPCASE
source: CLEAR DATA
vi: XÓA DỮ LIỆU
zh_cn: 清除数据
zh_tw: 清除數據

# confirmationUPCASE
source: CONFIRMATION
vi: XÁC NHẬN
zh_cn: 确认
zh_tw: 確認

# processConfirmationMessage
source: Are you sure you want to process this warehouse export request?
vi: Xử lý yêu cầu xuất kho?
zh_cn: 确认要处理这些数据吗？
zh_tw: 您確定要處理嗎？

# warehouseOutSuccessMessage
source: The material has been successfully sent for warehouse-out processing.
vi: Đã xuất kho thành công.
zh_cn: 出库成功
zh_tw: 出庫成功

# noScanDataMessage
source: No Scan data
vi: Không có dữ liệu
zh_cn: 暂无扫描数据
zh_tw: 尚未掃描任何資料

# inputQuantityLabel
source: Input Quantity
vi: Số lượng
zh_cn: 输入数量
zh_tw: 數量

# inputQuantityHint
source: Enter quantity
vi: Nhập số lượng
zh_cn: 请输入数量
zh_tw: 請輸入數量

# inputQuantityEmptyMessage
source: Please enter a quantity
vi: Nhập số lượng
zh_cn: 数量不能为空
zh_tw: 請輸入數量

# inputQuantityInvalidNumberMessage
source: Please enter a valid number
vi: Nhập số hợp lệ
zh_cn: 请输入有效数字
zh_tw: 請輸入有效數字

# inputQuantityGreaterThanZeroMessage
source: Quantity must be greater than 0
vi: SL phải > 0
zh_cn: 数量必须大于零
zh_tw: 數量必須大於零

# inputQuantityInvalidMessage
source: Quantity invalid
vi: SL không hợp lệ
zh_cn: 无效的数量
zh_tw: 無效的數量

# addressLabel
source: Receiver
vi: Người nhận
zh_cn: 地址
zh_tw: 地址

# switchFunctionErrorMessage
source: You must clear data first to switch functionality!
vi: Xóa dữ liệu trước!
zh_cn: 切换功能失败
zh_tw: 切換功能時發生錯誤

# increaseButton
source: Increase
vi: Tăng
zh_cn: 增加
zh_tw: 增加

# decreaseButton
source: Decrease
vi: Giảm
zh_cn: 减少
zh_tw: 減少

# saveButton
source: Save
vi: Lưu
zh_cn: 保存
zh_tw: 儲存

# cameraErrorUPCASE
source: CAMERA ERROR
vi: LỖI CAMERA
zh_cn: 相机错误
zh_tw: 相機錯誤

# confirmationTitleUPCASE
source: CONFIRMATION
vi: XÁC NHẬN
zh_cn: 确认
zh_tw: 確認

# materialNameLabel
source: Name
vi: Tên
zh_cn: 名稱
zh_tw: 名稱

# warehouseQtyImportLabel
source: Import Quantity
vi: SL nhập
zh_cn: 入库数量
zh_tw: 入庫數量

# warehouseQtyExportLabel
source: Export Quantity
vi: SL xuất
zh_cn: 出库数量
zh_tw: 出庫數量

# inputQuantityEmptyValidationMessage
source: Please enter a quantity
vi: Nhập số lượng
zh_cn: 数量不能为空
zh_tw: 請輸入數量

# inputQuantityInvalidNumberValidationMessage
source: Please enter a valid number
vi: Nhập số hợp lệ
zh_cn: 请输入有效数字
zh_tw: 請輸入有效數字

# inputQuantityGreaterThanZeroValidationMessage
source: Quantity must be greater than 0
vi: SL phải > 0
zh_cn: 数量必须大于零
zh_tw: 數量必須大於零

# inputQuantityInvalidValidationMessage
source: Quantity invalid
vi: SL không hợp lệ
zh_cn: 无效的数量
zh_tw: 無效的數量

# clearDataMessageWarehouseOut
source: Are you sure you want to clear all data?
vi: Xóa tất cả dữ liệu?
zh_cn: 确定要清除出库数据吗？
zh_tw: 您確定要清除所有出庫數據嗎？

# enterOrSelectAddressHint
source: Enter or Select address
vi: Nhập/chọn địa chỉ
zh_cn: 输入或选择地址
zh_tw: 輸入或選擇地址

# enterOrSelectAddressValidationMessage
source: Please enter or select an address
vi: Nhập/chọn địa chỉ
zh_cn: 请输入或选择地址
zh_tw: 請輸入或選擇地址

# selectAddressTitleUPCASE
source: SELECT ADDRESS
vi: CHỌN ĐỊA CHỈ
zh_cn: 选择地址
zh_tw: 選擇地址

# materialWithCodeNotFoundMessage
source: Material with code {code} not found in the System.
vi: Không tìm thấy mã {code}.
zh_cn: 系统中未找到代码为 {code} 的物料。
zh_tw: 系統中找不到代碼為 {code} 的物料。

source: Failed to get material information
vi: Không lấy được thông tin
zh_cn: 获取物料信息失败
zh_tw: 取得物料資訊失敗

source: Failed to process exporting warehouse
vi: Lỗi xuất kho
zh_cn: 无法处理出口仓库
zh_tw: 無法處理出口倉庫

# cannotAccessCameraWithoutParam
source: Cannot access to camera
vi: Không mở camera
zh_cn: 无法访问相机
zh_tw: 無法存取相機

# materialsSavedInWarehouseMessage
source: Materials saved in warehouse
vi: Đã lưu vào kho
zh_cn: 仓库中保存的材料
zh_tw: 倉庫中保存的材料

# thisItemHasBeenScannedMessage
source: This item has been scanned.
vi: Mục đã quét.
zh_cn: 此商品已被扫描。
zh_tw: 此商品已掃描。

# errorWhileCheckingMaterialMessage
source: Error while checking materials.
vi: Lỗi kiểm tra.
zh_cn: 检查材料时出错。
zh_tw: 檢查材料時發生錯誤。

# materialIsEmptyMessage
source: Material is empty.
vi: Vật liệu trống.
zh_cn: 材料为空。
zh_tw: 材料為空。

# cannotSavingInventoryListMessage
source: Cannot saving inventory list.
vi: Không lưu được.
zh_cn: 无法保存库存清单。
zh_tw: 無法保存庫存清單。

# inventoryPageTitle
source: INVENTORY
vi: KIỂM KÊ
zh_cn: 存货
zh_tw: 存貨

# clearDataMessageInventoryCheck
source: Are you sure you want to clear all data?
vi: Xóa tất cả?
zh_cn: 您确定要清除所有数据吗？
zh_tw: 您確定要清除所有資料嗎？

# scannedItemsInventoryCheckLabel
source: Scanned Items ({items})
vi: Đã quét ({items})
zh_cn: 已扫描商品（{items}）
zh_tw: 已掃描商品（{items}）

# noDataMessage
source: No data
vi: Không có dữ liệu
zh_cn: 没有数据
zh_tw: 沒有數據

# profilePageTitle
source: PROFILE
vi: HỒ SƠ
zh_cn: 轮廓
zh_tw: 輪廓

# logoutDialogLabel
source: LOGOUT
vi: ĐĂNG XUẤT
zh_cn: 登出
zh_tw: 登出

# materialNotFoundMessage
source: Material not exist in the System.
vi: Không tìm thấy vật liệu.
zh_cn: 系统中不存在该材料。
zh_tw: 系統中不存在該材質。

# invalidCredentialsMessage
source: Invalid credentials
vi: Sai thông tin
zh_cn: 凭证无效
zh_tw: 憑證無效

# validateTokenMessage
source: Token validation not implemented
vi: Chưa hỗ trợ xác thực token
zh_cn: 未实现令牌验证
zh_tw: 未實作令牌驗證

# failedToLoadProcessItemsMessage
source: Failed to load processing items
vi: Không tải được dữ liệu
zh_cn: 无法加载处理项目
zh_tw: 無法載入處理項目

# processingFetchDataFailedMessage
source: Processing to fetch data has been failed
vi: Lấy dữ liệu thất bại
zh_cn: 获取数据处理失败
zh_tw: 取得資料處理失敗

# getAddressListFailedMessage
source: Get Address List failed
vi: Lỗi lấy địa chỉ
zh_cn: 获取地址列表失败
zh_tw: 取得地址清單失敗

# somethingWentWrongMessage
source: An error occurred, please check the data.
vi: Đã xảy ra lỗi, kiểm tra lại.
zh_cn: 发生错误，请检查数据。
zh_tw: 發生錯誤，請檢查資料。

# cannotGetProcessingItemsMessage
source: Get Items for Home List has been failed.
vi: Lỗi lấy danh sách.
zh_cn: 获取家庭列表项目失败。
zh_tw: 取得主頁清單的項目失敗。

# withdrawLabel
source: Withdraw
vi: Thu hồi
zh_cn: 提取
zh_tw: 提取

# exitDialogLabel
source: EXIT
vi: THOÁT
zh_cn: 退出
zh_tw: 退出

# exitDialogMessage
source: Are you sure you want to exit the app?
vi: Thoát ứng dụng?
zh_cn: 您确定要退出应用程序吗？
zh_tw: 您確定要退出應用程式嗎？

# exitDialogConfirmButton
source: Exit
vi: Thoát
zh_cn: 退出
zh_tw: 退出

# processPageTitleUPCASE
source: PROCESS
vi: XỬ LÝ
zh_cn: 处理
zh_tw: 處理

# searchHintLabel
source: Search
vi: Tìm
zh_cn: 搜索
zh_tw: 搜索

# storageFailedMessage
source: Material has been stored.
vi: Lưu thất bại: Kiểm tra QC hoặc liên hệ IT.
zh_cn: 存储失败: 请检查质量检查是否已完成，或联系IT部门以获取说明。
zh_tw: 存儲失敗: 請檢查質量檢查是否已完成，或聯繫IT部門以獲取說明。

# noDataAvailableMessage
source: No data available for recall.
vi: Không có dữ liệu thu hồi.
zh_cn: 沒有可撤回數據。
zh_tw: 沒有可供回憶的數據。

# operationModeLabel
source: Operation Mode
vi: Chế độ
zh_cn: 操作模式
zh_tw: 操作模式

# alreadyShippedMessage
source: Already shipped
vi: Đã xuất
zh_cn: 已全部出库
zh_tw: 已發貨

# quantityNotEnoughMessage
source: Quantity not enough
vi: Số lượng không đủ
zh_cn: 数量不足
zh_tw: 數量不足

# shippedLabel
source: Shipped: {quantity}
zh_cn: 已出库: {quantity}
zh_tw: 已發貨: {quantity}

# quantityLeftLabel
source: Quantity left: {quantity}
zh_cn: 剩余: {quantity}
zh_tw: 剩餘: {quantity}

# notInspectByQCMessage
source: Not inspected by QC
zh_cn: 未经过QC检查
zh_tw: 未經QC檢查

# qcStatusMessage
source: QC Status: {status}
zh_tw: QC狀態: {status}

# inspectByQCMessage
source: Inspected by QC
zh_tw: 已檢查QC

# performActionImportUncheckedMessage
source: Are you sure to perform this action? Items: {items}
zh_tw: 確定執行此操作？物料: {items}

# importUncheckedTitleUpcase
source: IMPORT UNCHECKED
zh_tw: 導入未檢查

# importUncheckedMenuTitle
source: Import Unchecked
zh_tw: 導入未檢查
